---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RbsRoutingPreferenceParam
source: html/9845fc0a-89d7-01a2-624a-6d9c885cc8b0.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RbsRoutingPreferenceParam Property

"Routing Preferences"

## Syntax (C#)
```csharp
public static ForgeTypeId RbsRoutingPreferenceParam { get; }
```